{"link": "https://www.huffpost.com/entry/american-airlines-passenger-banned-flight-attendant-punch-justice-department_n_632e25d3e4b0e247890329fe", "headline": "American Airlines Flyer Charged, Banned For Life After Punching Flight Attendant On Video", "category": "U.S. NEWS", "short_description": "He was subdued by passengers and crew when he fled to the back of the aircraft after the confrontation, according to the U.S. attorney's office in Los Angeles.", "authors": "Mary Papenfuss", "date": "2022-09-23", "doc_text": "A volatile passenger has been charged with a federal crime — and banned for life from American Airlines — after he was captured on video punching a flight attendant in the head, according toJustice Departmentand airline officials.The incident occurred Wednesday on a flight from San José del Cabo in Mexico to Los Angeles.Alexander Tung Cuu Le, 33, of Westminster, in Southern California, was arrested when the aircraft landed at Los Angeles International Airport, according to an American Airlines official. He was charged Thursday with one count ofinterference with flight crew members and attendants, which carries a maximum penalty of up to 20 years in prison, said a statement by theU.S. Attorney’s Officefor the Central District of California.According to the statement, Le grabbed a flight attendant’s shoulder and demanded coffee about 20 minutes after the aircraft took off. He also allegedly disrupted passengers by hanging out near the first-class section of the cabin.When another flight attendant told Le to return to his assigned seat, Le “allegedly stood up and assumed a fighting stance towards the flight attendant by making closed fists with both of his hands, which the flight attendant interpreted as a threat,” according to the DOJ statement.A video taken by fellow passenger Barrie Livingstone shows Le apparently initially swinging his arm at the flight attendant but missing. As the attendant turned to walk away, Le can be seen rushing forward to strike the attendant in the head, eliciting cries of concern and outrage on the aircraft. The attack was “witnessed by several passengers,” the Justice Department said.Le then “fled” to the back of the plane, where he was “apprehended by several passengers” and crew members, the statement added.Le’s “hands and legs were cuffed,” but he “continuously unbuckled his seatbelt, causing flight attendants to restrain him to the seat with seatbelt extenders,” officials noted.Le has been barred from all future flights by American Airlines.“Acts of violence against our team members are not tolerated by American Airlines,” said a statement from American. “The individual involved in this incident will never be allowed to travel with us in the future, and we will work closely with law enforcement in their investigation.”The airline thanked crew members and passengers for restraining Le until the aircraft was met by law enforcement at LAX.Le appeared Thursday at the U.S. District Court in downtown Los Angeles, where he was charged.The hearing was continued to Monday, Ciaran McEvoy, a spokesperson for the U.S. attorney’s office, toldSFGate. “That will be adetention hearingto determine his bond, if any. Mr. Le has not pleaded to anything yet,” McEvoy added.Attacks on flight attendants have skyrocketed in the last two years, largely triggered by sometimes violent, defiant responses to requirements to wear masks earlier in the COVID-19 pandemic. The Federal Aviation Administration logged an incredible5,981 “unruly passenger reportslast year. In 2020, the FAAinvestigated only 183 reports.", "summary": "Alexander Tung Cuu Le, 33, has been charged with a federal crime and banned for life from American Airlines after punching a flight attendant on a flight from Mexico to Los Angeles. Le was arrested upon landing and charged with interference with flight crew members and attendants, which carries a maximum penalty of 20 years in prison. The incident is part of a larger trend of increased attacks on flight attendants, with the FAA logging nearly 6,000 \"unruly passenger reports\" in 2021.\n"}
{"link": "https://www.huffpost.com/entry/belk-worker-found-dead-columbiana-centre-bathroom_n_632c5f8ce4b0572027b0251d", "headline": "Cleaner Was Dead In Belk Bathroom For 4 Days Before Body Found: Police", "category": "U.S. NEWS", "short_description": "The 63-year-old woman was seen working at the South Carolina store on Thursday. She was found dead Monday after her family reported her missing, authorities said.", "authors": "", "date": "2022-09-22", "doc_text": "COLUMBIA, S.C. (AP) — A 63-year-old worker died in the public bathroom of a South Carolina department store, but her body was not discovered for four days, authorities said.Bessie Durham, who worked for an outside company that cleans the Belk store at Columbiana Centre, was found dead Monday, investigators said. Her cleaning cart was outside the restroom.Durham was last seen Thursday at work and her body was found shortly after her family filed a missing person report, Columbia Deputy Police Chief Melron Kelly, toldWIS-TV.The Lexington County Coroner’s Office said there are no signs someone killed Durham or that she was using drugs. An autopsy is planned Thursday to determine her cause of death.Durham was seen on a surveillance camera going in the bathroom at 7 a.m. Thursday and she did not come out. Her body was found around 8 p.m. Monday, the coroner’s office said.The store was open regularly over those four days and Kelly said police are investigating to see if anyone was negligent.“We’re still working with the store to find out what their process is to closing down the store, inspecting the store and things of that nature,” Kelly said.Belk is helping authorities figure out what happened and is sending its deepest condolences to Durham’s family, the company said in a statement.", "summary": "A 63-year-old cleaner, Bessie Durham, was found dead in a South Carolina department store's public restroom, four days after she was last seen. Authorities are investigating potential negligence, while an autopsy is planned to determine the cause of death. The store remained open during this period.\n"}
{"link": "https://www.huffpost.com/entry/biden-un-russian-war-an-affront-to-bodys-charter_n_632ad9e3e4b0bfdf5e1bf5f7", "headline": "Biden At UN To Call Russian War An Affront To Body's Charter", "category": "WORLD NEWS", "short_description": "White House officials say the crux of the president's visit to the U.N. this year will be a full-throated condemnation of Russia and its brutal war.", "authors": "Aamer Madhani, AP", "date": "2022-09-21", "doc_text": "NEW YORK (AP) — PresidentJoe Bidenis ready to make the case to world leaders at theU.N. General Assemblythat Russia’s “naked aggression” in Ukraine is an affront to the heart of what the international body stands for as he looks to rally allies to stand firm in backing the Ukrainian resistance.Biden, during his time at the U.N. General Assembly, also planned to meet Wednesday with new BritishPrime Minister Liz Truss,announce a global food security initiative and press allies to meet an $18 billion target to replenish the Global Fund to Fight AIDS, tuberculosis and malaria.But White House officials say the crux of the president’s visit to the U.N. this year would be a full-throated condemnation of Russia as its brutalwar nears the seven-month mark.“He’ll offer a firm rebuke of Russia’s unjust war in Ukraine and make a call to the world to continue to stand against the naked aggression that we’ve seen these past several months,” White House national security adviser Jake Sullivan said in previewing the president’s address. “He will underscore the importance of strengthening the United Nations and reaffirm core tenets of its charter at a time when a permanent member of the Security Council has struck at the very heart of the charter by challenging the principle of territorial integrity and sovereignty.”The address comes as Russian-controlled regions of eastern and southern Ukraine have announced plansto hold Kremllin-backed referendumsin days ahead on becoming part of Russia and as Moscow is losing ground in the invasion. Russian President Vladimir Putin on Wednesdayannounced a partial mobilizationto call up 300,000 reservists and accused the West of engaging in “nuclear blackmail.”Biden is confronting no shortage of difficult issues as leaders gather this year.In addition to the Russian war in Ukraine,Europeanfears that a recessioncould be just around the corner are heightened. Administration concerns grow by the day that time is running short to revive theIran nuclear dealand over China’s saber-rattling on Taiwan.When he addressed last year’s General Assembly,Biden focused on broad themes of global partnership, urging world leaders to act with haste against the coronavirus, climate change and human rights abuses. And he offered assurances that his presidency marked a return of American leadership to international institutions following Donald Trump’s “America First” foreign policy.But one year later, global dynamics have dramatically changed.Stewart Patrick, senior fellow and director of the Global Order and Institutions Program at the Washington think tank Carnegie Endowment for International Peace, wrote in ananalysisthat Biden’s task this year is “immense” compared to his first address to the U.N. as president.“Last year, the U.S. leader won easy plaudits as the ‘anti-Trump,’ pledging that ‘America was back,’” Patrick said. “This year demands more. The liberal, rules-based international system is reeling, battered by Russian aggression, Chinese ambitions, authoritarian assaults, a halting pandemic recovery, quickening climate change, skepticism of the U.N.’s relevance, and gnawing doubts about American staying power.”Beyond diplomacy, the president is also doing some politicking. This year’s gathering comes less than seven weeks beforepivotal midterm electionsin the United States. Shortly after arriving in Manhattan on Tuesday night, Biden spoke at a Democratic National Committee fundraiser for about 100 participants that raised nearly $2 million, and he’s set to hold another fundraiser on Thursday before heading back to Washington.His Wednesday address comes on the heels of Ukrainian forcesretaking control of large stretches of territorynear Kharkiv. But even as Ukrainian forces have racked up battlefield wins, much of Europe is feeling painful blowback from economic sanctions levied against Russia. A vast reduction in Russian oil and gas has led to a sharp jump in energy prices, skyrocketing inflation and growing risk of Europe slipping into a recession.Biden’s visit to the U.N. also comes as his administration’s efforts to revive the 2015 Iran nuclear deal appears stalled.The deal brokered by the Obama administration — and scrapped by Trump in 2018 — provided billions of dollars in sanctions relief in exchange for Iran’s agreement to dismantle much of its nuclear program and open its facilities to extensive international inspection.Sullivan said no breakthrough with Iran is expected during the General Assembly but Biden would make clear in his speech that a deal can still be done “if Iran is prepared to be serious about its obligations.” He added that administration officials would be consulting with fellow signatories of the 2015 deal on the sidelines of this week’s meetings.This year’s U.N. gathering is back to being a full-scale, in-person event after two years of curtailed activity due to the pandemic. In 2020, the in-person gathering was canceled and leaders instead delivered prerecorded speeches; last year was a mix of in-person and prerecorded speeches. Biden and first lady Jill Biden were set to host a leaders’ reception on Wednesday evening.China’s President Xi Jinping opted not to attend this year’s U.N. gathering, but his country’s conduct and intentions will loom large during the leaders’ talks.Last month, the U.N. human rights office raised concerns about possible“crimes against humanity”in China’s western region against Uyghurs and other largely Muslim ethnic groups. Beijing has vowed to suspend cooperation with the office and blasted what it described as a Western plot to undermine China’s rise.Meanwhile, China’s government on Monday said Biden’s statement in a CBS “60 Minutes” interview that American forceswould defend Taiwanif Beijing tried to invade the self-ruled island was a violation of U.S. commitments on the matter, but it gave no indication of possible retaliation.The White House said after the interview that there has been no change in U.S. policy on Taiwan, which China claims as its own. That policy says Washington wants to see Taiwan’s status resolved peacefully but doesn’t say whether U.S. forces might be sent in response to a Chinese attack.___Follow AP coverage of the U.N. General Assembly athttps://apnews.com/hub/united-nations-general-assembly", "summary": "President Joe Biden is set to condemn Russia's aggression in Ukraine at the U.N. General Assembly, urging allies to support Ukraine. He also plans to meet with British Prime Minister Liz Truss, announce a global food security initiative, and push for an $18 billion target to replenish the Global Fund to Fight AIDS, tuberculosis, and malaria. Amidst these, Biden faces challenges including the Russian war in Ukraine, potential European recession, reviving the Iran nuclear deal, and China's stance on Taiwan."}
{"link": "https://www.huffpost.com/entry/man-sets-fire-protest-abe-funeral_n_632ae462e4b07198f0146afd", "headline": "Man Sets Himself On Fire In Apparent Protest Of Funeral For Japan's Abe", "category": "WORLD NEWS", "short_description": "The incident underscores a growing wave of protests against the funeral for Shinzo Abe, who was one of the most divisive leaders in postwar Japanese politics.", "authors": "Mari Yamaguchi, AP", "date": "2022-09-21", "doc_text": "TOKYO (AP) — A man set himself on fire near the Japanese prime minister’s office in Tokyo on Wednesday in an apparent protest against the state funeral planned next week for former leader Shinzo Abe, officials and media reports said.The man, believed to be in his 70s, sustained burns on large parts of his body but was conscious and told police that he set himself on fire after pouring oil over himself, Kyodo News agency reported.A note was found with him that said, “Personally, I am absolutely against” Abe’s funeral, Kyodo reported.A Tokyo Fire Department official confirmed that a man set himself afire on the street in Tokyo’s Kasumigaseki government district and that he was alive when he was taken to a hospital by ambulance, but declined to give further details, including the man’s identity, motive or condition, citing the sensitivity of what was a police matter.Police called it an attempted suicide and refused to give further details because the case involved no criminal intent. Police also declined to comment on a report that a police officer was caught in the fire.The incident underscores a growing wave of protests against the funeral for Abe, who was one of the most divisive leaders in postwar Japanese politics because of his revisionist view of wartime history, support for a stronger military, and what critics call an autocratic approach and cronyism. More protests are expected in coming days, including the day of the funeral next week.It also is an embarrassment for police, who have stepped up security for an event expected to be attended by about 6,000 people, including U.S. Vice President Kamala Harris and other dignitaries.Policewere also partly blamed for insufficient protection of Abe, who was shot to death by a gunman who approached him from behind as he was giving an outdoor campaign speech in July.Prime Minister Fumio Kishida is in New York for the annual U.N. General Assembly meeting of world leaders. He gave a speech Tuesday expressing disappointment over the Security Council’s failure to respond to the Russian invasion of Ukraine because of Russia’s permanent veto and called for reforms that would allow the U.N. to better defend global peace and order.The planned state funeral for Abe has become increasingly unpopular among Japanese as more details emerge about the governing Liberal Democratic Party’s and Abe’s links to the Unification Church, which built close ties with party lawmakers over their shared interests in conservative causes.The suspect in Abe’s assassination reportedly believed his mother’s large donations to the church ruined his family.The LDPhas said nearly half its lawmakers have ties to the church, but party officials have denied ties between the party as an organization and the church.Kishida has said Abe deserves the honor of a state funeral as Japan’s longest-serving post-World War II leader and for his diplomatic and economic achievements.Critics have said it was decided undemocratically and is an inappropriate and costly use of taxpayers’ money. They say Kishida decided to hold a state funeral to please Abe’s party faction and buttress his own power. Support ratings for Kishida’s government have weakened amid public dissatisfaction over his handling of the party’s church ties and the funeral plans.A family funeral for Abe was held at a Buddhist temple in July. The state funeral is scheduled for next Tuesday at the Budokan martial arts arena in Tokyo.", "summary": "A man set himself on fire near the Japanese prime minister's office in Tokyo in protest against the state funeral for former leader Shinzo Abe. The man, believed to be in his 70s, survived the incident. The act highlights growing opposition to the funeral due to Abe's controversial politics and alleged links to the Unification Church. Critics argue the state funeral is an inappropriate use of taxpayers' money."}
{"link": "https://www.huffpost.com/entry/virginia-thomas-agrees-to-interview-with-jan-6-panel_n_632ba0f2e4b09d8701bbe16d", "headline": "Virginia Thomas Agrees To Interview With Jan. 6 Panel", "category": "U.S. NEWS", "short_description": "Conservative activist Virginia Thomas, the wife of Supreme Court Justice Clarence Thomas, has agreed to participate in a voluntary interview with the House panel investigating the Jan. 6 insurrection.", "authors": "Eric Tucker and Mary Clare Jalonick, AP", "date": "2022-09-21", "doc_text": "Virginia “Ginni” Thomas,the wife of Supreme Court JusticeClarence Thomas,has agreed to be interviewed by theHouse select committee investigating the events of Jan. 6, 2021,sometime in the coming weeks.The news was first reported byCNN correspondent Jamie Gangelandthen later by MSNBC’s Ali Vitali,who said Thomas responded to a letter asking her to appear before the committee and was not subpoenaed.Thomas’ involvement in former PresidentDonald Trump’s “stolen election” lies and the U.S. Capitol riot has been a subject of interest for a while,especially since there is evidenceshe urged at least two Wisconsin state lawmakers, including the chair of the Senate elections committee, to overturnPresident Joe Biden’s 2020 election win.She also reportedlysent messagesto more than two dozen lawmakers in Arizona, arguing, without evidence, that there had been widespread election fraud in the 2020 presidential election.In addition, there are texts in which Thomas urged then-White House chief of staffMark Meadowstocontinue the battle to overturn election results,as well as texts and emails to Trump ally attorney and “coup memo” authorJohn Eastmandiscussing how to upend the vote.“Help This Great President stand firm, Mark,” Thomas wrote Meadows after the 2020 election. “The majority knows Biden and the Left is attempting thegreatest Heist of our History.”Thomas had turned down other requests to appear before the House panel.In June, her attorney Mark Paoletta said thatthere was no reason for her to testifybefore the House select committee and said he had “serious concerns” about any potential interview.No date has been announced for Thomas’ interview with the committee, which will hold its next hearing Sept. 28.The news understandably aroused the interest of Twitter users, many of whom predicted how her testimony might go.Still, others felt it was important to get her testimony on the record.", "summary": "Virginia \"Ginni\" Thomas, wife of Supreme Court Justice Clarence Thomas, has agreed to be interviewed by the House select committee investigating the Jan. 6, 2021 events. Thomas has been linked to former President Donald Trump's \"stolen election\" claims and the U.S. Capitol riot. She reportedly urged lawmakers to overturn President Joe Biden's 2020 election win and sent messages alleging widespread election fraud.\n"}
{"link": "https://www.huffpost.com/entry/valery-polyakov-dies_n_6329d497e4b0913a3dd5336c", "headline": "Russian Cosmonaut Valery Polyakov Who Broke Record With 437-Day Stay In Space Dies At 80", "category": "WORLD NEWS", "short_description": "Polyakov's record-breaking trip to outer space saw him orbit Earth 7,075 times and travel nearly 187 million miles.", "authors": "Marco Margaritoff", "date": "2022-09-20", "doc_text": "Dr. Valery Polyakov, a physician-turned-cosmonaut who spent 437 days in outer space and set the world record, died at 80. Russian space agency Roscosmos announced his death on Monday without disclosing the cause or location.“His research helped prove that the human body is ready for flights not only to near-Earth orbit, but also to deep space,”Roscosmos wrote in a Telegram post. “We express our deepest condolences to the relatives and friends of Valery Vladimirovich.”He was born Valery Ivanovich Korshunov on April 27, 1942, but changed his name after being adopted in 1957,according to the New Mexico Museum of Space History. Polyakov began as a physician and joined the Institute of Biomedical Problems in Moscow in 1971,according to CNN.After undergoing spaceflight training to demonstrate he could administer assistance to fellow astronauts in orbit and passing his exams in 1972, Polyakov became one of the first doctor-cosmonaut trainees in history. He earned his Candidate of Medical Sciences degree in 1976.Polyakov’s first lengthy space mission in 1988 lasted eight months, and he became deputy director of the institute he once joined as a young man upon returning back to Earth. It was his second and final mission, however, that made history.Now a specialist in the nascent field of space medicine, Polyakov volunteered to prove human beings could withstand microgravity and reach Mars,according to Wired. His flight to dock with Russia’s Mir space station launched on Jan. 8, 1994 — and Polyakov didn’t return until March 22, 1995.Polyakov orbited Earth 7,075 times and traveled around 187 million miles during those 14 months — during which millions of people back on Earth had marveled at the launch of the Netscape Navigator internet browser, the opening of the English Channel Tunnel and O.J. Simpson’s high-speed police chase.According to “The Story of Manned Space Stations” by Philip Baker, American astronaut Norman Thagard said Polyakov returned to Earth “big and strong” and looked “like he could wrestle a bear.” Polyakov exercised during his mission and refused assistance upon landing, opting to walk on his own.“When his capsule landed in Kazakhstan he walked from it to a nearby chair, a tremendous achievement,”wrote Baker. “He also stole a cigarette from a friend nearby, but could hardly be blamed for that. He sipped a small brandy and inwardly celebrated his mission.”WhileNASA astronauts Scott Kelly and Mark Vande Hei respectively spent 340 and 355 consecutive days in space and Peggy Whitson spent 665 cumulative days in space, the consecutive 437-day stay accomplished by Valery Polyakov remains unprecedented.“His record still stands today,” wrote Baker, “and it is unlikely to be broken until man ventures to Mars.”", "summary": "Dr. Valery Polyakov, a Russian physician-turned-cosmonaut who set a world record by spending 437 days in outer space, has died at 80. The cause of death was not disclosed. Polyakov's research contributed significantly to understanding the human body's capacity for long-duration space flights. His record remains unbroken.\n"}
{"link": "https://www.huffpost.com/entry/hulu-reboot-should-you-watch-it_n_6324a099e4b0eac9f4e18b46", "headline": "'Reboot' Is A Clever And Not Too Navel-Gazey Look Inside TV Reboots", "category": "CULTURE & ARTS", "short_description": "Starring Keegan-Michael Key, Judy Greer and Johnny Knoxville, the Hulu show follows the revival of a fictional early 2000s sitcom.", "authors": "Marina Fang and Candice Frederick", "date": "2022-09-20", "doc_text": "The new Hulu comedy series “Reboot” is a curious product of this particular cultural era. It follows the reboot of a fictional early 2000s family sitcom, “Step Right Up,” and the tensions it places on its dysfunctional cast and crew.Among the stars of the show (and show within a show) are Keegan-Michael Key, Judy Greer and Johnny Knoxville, whose characters begrudgingly sign on for the reboot after many disappointing career and life changes since the original run. Paul Reiser — who was recently in a reboot of his own, with the 2019 revival of 1990s sitcom “Mad About You” — and Rachel Bloom play Gordon and Hannah, the father-daughter team of showrunners behind the relaunch of “Step Right Up.”Premiering Tuesday, the eight-episode series marks creator Steven Levitan’s first show since thelong-running ABC sitcom “Modern Family.”HuffPost Senior Culture Reporters Marina Fang and Candice Frederick discuss what they thought of “Reboot” and assess where it fits into the larger cultural conversation on the topic.Marina Fang:All of us on the HuffPost culture desk talk a lot about the seemingly never-ending stream of reboots, revivals, re-imaginings, etc., etc. — what I often like to joke is the “reboot industrial complex.” So the idea of a sitcom about a fictional reboot of a sitcom, involving a lot of people who’ve been part of major sitcoms before, definitely piqued my interest. Candice, what did you think of “Reboot,” and how well do you think it captures this cultural moment we’re in?Candice Frederick:Yeah, the reboot industrial complex is real, and it’s exhausting. So, I went into “Reboot” fearing it would be a bit navel-gazey and unnecessary.But I was struck by how much it delves into what it means to actually go forward with a reboot, the human impact of it. Like, how the actors, who haven’t worked in forever — or who haven’t gotten the type of prestige work they thought would follow after the series — are ill-equipped to deal with the new celebrity industrial complex where media can be very vampiric with their personal questions, or what it means to bring a show from a certain period into present day.What’s to become of the original staff writers? Can they write dialogue that pertains or contends with today’s culture? What does that look like when they have to share a writing room with younger writers? The generational questions were interesting to me.What did you think going into it?Initial ThoughtsMF:Absolutely, I had those exact same fears. But I think it finds the right balance in its meta jokes about the industry. For example, the show within a show, like the show itself, is being produced at Hulu, and one of the characters is a fictionalized Hulu executive. That was all very funny.Once I started watching it, I found myself wishing it had a sharper point of view about the concept of reboots — a specific thing it was trying to say about it all. But then, when you and I were deciding to do this “Should You Watch It?” article, you mentioned everything you said above. And I realized you’re totally right, that this is what really makes this show interesting.In the larger cultural discussion around reboots, we don’t talk as much about what it means for the actors and writers to return to something they made 20 years ago, that probably hasn’t aged well, and how they’re probably in a very different place in their lives and careers when they decide to do these reboots. This show does a great job of exploring those dynamics.Standout PerformancesMF:The dynamic between Bree and Reed (Greer and Key) felt totally lived-in. Like, I totally bought that they had a thing 20 years ago, and being together again is bringing up all kinds of messy feelings. I loved both of those performances, part of a really stacked cast on this show.Candice, what did you think of the cast, and were there any really standout performances for you?CF:OMG yes! Loved that the comedy exec at Hulu (Krista Marie Yu) is hyperserious and actually knows nothing about comedy. I’m sure this happens a lot in the industry.To your point, though, it did stick out to me that the show doesn’t have a point of view about reboots — especially since you and I both definitely do! But I also wonder if these folks who decide to do a reboot actually have a point of view on that. Some need the money. Others need their careers reinvigorated. Others, especially women like Judy Greer’s character, need to prove that they still have it and that the industry can’t send them out to pasture just yet. That was all very interesting to me.LOL, Judy and Keegan are comedy gold, totally agree. You know who I also thought was quite interesting? Alyah Chanelle Scott, who plays Timberly, who’s kind of a plant from the reality TV show industrial complex. She parlayed that into a scripted TV career. But when she tries to prove herself, of course people like Bree feel threatened. That was a totally unexpected storyline that actually made a lot of sense to me, and I think both women are very good there.What did you think of Johnny Knoxville and his character (who I admit I have never actually seen on anything before)? I intentionally avoided the whole “Jackass” phenomenon.MF:Yes, I liked how that all felt very real!I also have never watched any of the installments of the “Jackass” franchise. I did like that his character seemed pretty reflective of a washed-up, middle-aged white dude — like, you can easily picture a real-life equivalent.CF:Same! He is definitely a major source of comic relief but actually has gravitas. Like a whole lot of these characters, he’s been sort of just ... floating since this TV show. So, we get to see him really wrangle with that as well.So, there’s a whole other section of the show that could have possibly been its own series, which is the relationship between Rachel Bloom’s and Paul Reiser’s characters, Hannah and Gordon. As a stand-alone character, I think Gordon is actually more interesting as the returning showrunner who’s trying to navigate the new turf and having to partner with his daughter, Hannah. Hannah is the more unsure character, who’s still getting her feet wet. But we again see how these two generations can work together.MF:Yeah, I liked seeing the writers room, which is another place where the show could have gotten a bit too navel-gazey, but it really works. Gordon is used to doing things the old way: hiring all of his friends, writing a bunch of hacky, tired jokes, etc. Meanwhile, Hannah is trying to make a more substantive show and hire a more inclusive writers room. The way they are constantly at an impasse feels like a lot of what we see play out in real life.Were there any other high points for you, or anything else you wanted to shout out? I think it’s safe to say we both liked it.CF:Yes! The genuineness of their reactions really worked. Like, that is exactly how I would imagine it would be.Should “Reboot” Get Another Season?CF:I think one question that came to mind is whether this deserves another season. Like, do we want more of this story? Honestly, I’d watch. I think there is more story to mine here.MF:That’s a good question! Like a lot of streaming series, these eight episodes tell a complete story but also leave just enough of an opening for another season. I could go either way. If they do pick it up for a second season, I’d watch it.CF:Same! I’d like to know more about these people. Somewhat related: Did you ever watch the show “Unreal”? I think this would make a good companion piece because of what they both say about the human impact of putting on what are ultimately scripted TV shows.MF:Yes, I did watch and really liked “Unreal,” until it went off the rails in its later seasons. There was alsoa short-lived Fox show last yearcalled “The Big Leap,” which is similar to “Unreal” but the show within a show is a dance competition series — another possibility, if you’re reading this and want to check out more of these shows with meta qualities about TV. Can we call them “Russian doll shows”? LOL.CF:Haha I love that — and now I have to find “The Big Leap”! Never even heard of it.So, Should You Watch It?MF:Anyway, should you watch “Reboot”? Definitely.CF:And yes, I really like “Reboot”! Would recommend.", "summary": "Hulu's new comedy series \"Reboot\" explores the cultural phenomenon of TV show reboots. The series, created by Steven Levitan, features stars like Keegan-Michael Key, Judy Greer, and Johnny Knoxville, and follows the relaunch of a fictional early 2000s sitcom. The show delves into the impact of reboots on actors and writers, and the challenges of updating a show for the present day."}
{"link": "https://www.huffpost.com/entry/hurricane-fiona-barrels-toward-turks-and-caicos-islands_n_63298597e4b0ed991abcacf9", "headline": "Fiona Barrels Toward Turks And Caicos Islands As Category 3 Hurricane", "category": "WORLD NEWS", "short_description": "The Turks and Caicos Islands government imposed a curfew as the intensifying storm kept dropping copious rain over the Dominican Republic and Puerto Rico.", "authors": "Dánica Coto, AP", "date": "2022-09-20", "doc_text": "SAN JUAN, Puerto Rico (AP) — Hurricane Fiona barreled toward the Turks and Caicos Islands on Tuesday as a Category 3 storm, prompting the government to impose a curfew.Forecasters said Fiona was expected to pass near Grand Turk, the British territory’s capital island, on Tuesday morning.“Storms are unpredictable,” Premier Washington Misick said in a statement from London, where he was attending the funeral of QueenElizabeth II. “You must therefore take every precaution to ensure your safety.”Misick is scheduled to return home on Thursday.Early Tuesday, Fiona was centered 20 miles (30 kilometers) southeast of Grand Turk Island. It had maximum sustained winds of 115 mph (185 kph) and was moving north-northwest at 10 mph (17 kph).The intensifying storm kept dropping copious rain over the Dominican Republic and Puerto Rico, where a 58-year-old man died after police said he was swept away by a river in the central mountain town of Comerio.Another death was linked to a power blackout — a 70-year-old man was burned to death after he tried to fill his generator with gasoline while it was running, officials said.The National Guard has rescued more than 900 people as floodwaters continue to rush through towns in eastern and southern Puerto Rico with up to 30 inches (76 centimeters) of rain forecast for some areas. Multiple landslides also were reported.The blow from Fiona was made more devastating because Puerto Rico has yet to recover from Hurricane Maria, which killed nearly 3,000 people and destroyed the power grid in 2017. Five years later, more than 3,000 homes on the island are still covered by blue tarps.Authorities said at least 1,300 people and some 250 pets remain in shelters across the island.Fiona sparked a blackout when it hit Puerto Rico’s southwest corner on Sunday, the anniversary of Hurricane Hugo, which slammed into the island in 1989 as a Category 3 storm.By Tuesday morning, authorities said they had restored power to more than 260,000 customers on the island of 3.2 million people.Puerto Rico Gov. Pedro Pierluisi has warned it could take days before everyone has electricity.Water service was cut to more than 837,000 customers — two thirds of the total on the island — because of turbid water at filtration plants or lack of power, officials said.Fiona is not expected to threaten the U.S. mainland.In the Dominican Republic, authorities reported one death: a man hit by a falling tree. The storm displaced more than 12,400 people and cut off at least two communities.The hurricane left several highways blocked, and a tourist pier in the town of Miches was badly damaged by high waves. At least four international airports were closed, officials said.The Dominican president, Luis Abinader, said authorities would need several days to assess the storm’s effects.Fiona previously battered the eastern Caribbean, killing one man in the French territory of Guadeloupe when floodwaters washed his home away, officials said.", "summary": "Hurricane Fiona, a Category 3 storm, is moving towards the Turks and Caicos Islands, causing the government to impose a curfew. The storm has already caused significant damage and fatalities in Puerto Rico and the Dominican Republic. The hurricane's impact is particularly severe in Puerto Rico, which is still recovering from Hurricane Maria in 2017. The National Guard has rescued over 900 people, and more than 1,300 people and 250 pets are in shelters."}
{"link": "https://www.huffpost.com/entry/ukraine-festival_n_6327b4a0e4b082746beb52c7", "headline": "‘Beautiful And Sad At The Same Time’: Ukrainian Cultural Festival Takes On A Deeper Meaning This Year", "category": "POLITICS", "short_description": "An annual celebration took on a different feel as Russia's invasion dragged into Day 206.", "authors": "Jonathan Nicholson", "date": "2022-09-19", "doc_text": "SILVER SPRING, Md. — For some, it’s hearing air raid sirens while talking with relatives back in Ukraine. For others, it’s the fear that Ukraine may become an economic basket case, even if it wins the war. Or that the world may forget the country’s plight altogether.Ukrainans, their friends and those simply curious about the country that’s fought Russia to standstill gathered on a sun-splashed weekend at St. Andrew Ukrainian Orthodox Cathedral in suburban Washington forthe region’s biggestannual Ukrainian cultural festival.Amid women wearing garlands in their hair, men wearing vyshyvanka — white shirts with intricately patterned embroidery down the front — and accompanied by traditional and pop Ukrainian music, the war was never far from people’s minds. What in past years had been a chance to showcase the culture and drink some beers from the home country had taken on a different, somewhat deeper meaning.“This year is particularly beautiful and sad at the same time,” said the church pastor, the Rev. Volodymr Steliac, as he formally opened the festival Saturday.“We have seen the worst of humanity but at the same time we have seen the best of humanity.”The festival opened on Day 206 of the invasion and came amid good news for Ukraine: asurprise counteroffensive in the northeastthat in a few days cleared Russians from towns and villages they had fought weeks to take earlier in the war.But the victory came with a price. In the strategic town of Izium,mass graves were found, similar to those seen in the capital Kyiv’s suburb of Bucha when the war began.Oksana Sukhina, who was staffing the booth of the U.S. Ukraine Foundation, where she is project director, said she wanted to see what the impact of the latest reports of atrocities will be on Europe.In the past, she said, some people suspected Ukrainians have exaggerated the cruelty of the Russians with reports of horrific claims like rape as a weapon of war and the theft of household goods then shipped to Russia.“Then you see Bucha, you see now Izyum. And we have yet to see Kherson and Mariupol and other places,” Sukhina said.Sukhina, 50, immigrated to the U.S. from Kyiv in 2020. Warned by former colleagues in the State Department about the likelihood of invasion, her parents arrived in Washington only days before the war.But as the prospect of Kyiv’s being captured receded, they went back, as did one of her daughters. They joined a 23-year-old son who left his IT job in Chicago in March to help deliver food and medical supplies in Kyiv.Sukhina said she tried to convince him to stay, but could not forbid him to leave because she had participated in pro-democracy protests in 2004 and 2014.“I’m proud of them. They are trying to do whatever they can. And this is what makes us win,” she said.Steliac said the church was open 24-7 when the war began. He was only getting two or three hours of sleep a night as volunteers dropped off humanitarian aid, organized it and shipped it to Ukraine.In one 48-hour period, he said, two of those young volunteers lost their fathers back in Ukraine.“The war is not there alone; the war is here as well,” Steliac said.Even though the process of gathering and sending aid has become more routine, even keeping in touch with family back home, he said, can be painful.“What was traumatic was that they were communicating with their relatives and they said, ‘Oh, a bomb fell just a couple of neighborhoods over’ and then they tried to connect again and the phone connection doesn’t go through,” Steliac said.“You think of the worst.”Alex Naumovych, a 36-year old mortgage loan officer from Ternopil in the western part of Ukraine, said he’s had calls interrupted by the air raid sirens, although now he said the alarms are likely to be ignored.Ternopil, a city of about 250,000, has no military targets, but he said his parents still hear the sirens daily. Ukraine tracks incoming missiles and activates local warning systems based on where they could potentially land, so even residents of cities not targeted are warned.“I’m worried that, sooner or later, one of those missiles may hit my city, like my parents’ place,” Naumovych said.Naumovych arrived in the U.S. almost 11 years ago. He had about $440 to his name then, he said, and started a landscaping business he sold years later for more than $1 million.“I love this country. Like you can come with $400 and six, seven years later you can be a millionaire,” he said.One of his big worries for Ukraine now is its economy, with so many people out of work because of the war and inflation projected to hit 30%.“The economy is in bad shape,” Naumovych said. “A lot of people left Ukraine and I’m not sure they’re coming back”The parents of software engineer Serhiy Vorobiov, 43, are near the war’s front line in Zaporizhzhya, a Russian-speaking region that includesEurope’s largest nuclear power plant.Russia has captured the plant and Ukrainians and others fear they will use it for blackmail.But Vorobiov said his parents, only 25 miles from the front lines in the city of Zaporizhzhya, still think everything is relatively safe. He said he chats with them with about the same frequency as before the war.“Maybe because there is no very high emergency at this point. I know it’s not to my defense, but that’s how it is,” he said.Vorobiov, his wife Oksana, 33, and their three young children, Yaromyr, Myroslava and Oksana, have lived in the U.S. since 2020. He said the war has reinforced his belief in getting rid of any Russian influence on their upbringing.“I always dreamed of it, I just didn’t want to be very tough in that. But now I have all the rights and I want to use it,” Vorobiov said.“I want them to forget [the] Russian language. We are from [the] Russian-speaking part of Ukraine, but now we are fixing it, as much as we can. Forget Russian, forget we were ever together, [forget] Soviet Union. I’m happy they don’t know what Soviet Union is.”But in her remarks to open the festivities,Oksana Markarova, the Ukrainian ambassadorto the United States, advised focusing on the present, not the past.“Please be joyful today,” she counseled.She said Russian leader Vladimir Putin and the Russians want Ukrainians to “sit down and cry” at the devastation.“This is what Russians want us to do. And we will not give it to them.”", "summary": "The annual Ukrainian cultural festival at St. Andrew Ukrainian Orthodox Cathedral in suburban Washington took on a deeper meaning this year due to the ongoing war with Russia. Attendees expressed concerns about the economic impact of the war on Ukraine and the atrocities committed by Russian forces. The festival also served as a platform for Ukrainians to share their experiences and fears, and to rally support for their home country."}
{"link": "https://www.huffpost.com/entry/mark-frerichs-release-us-taliban-prisoner-swap_n_63284bb2e4b000d9885d510b", "headline": "Family Of American Held In Afghanistan Says He Was Freed By Taliban In Prisoner Swap", "category": "U.S. NEWS", "short_description": "Mark Frerichs, a Navy veteran and civilian contractor, was kidnapped in Afghanistan in January 2020.", "authors": "Eric Tucker and Rahim Faiez, AP", "date": "2022-09-19", "doc_text": "WASHINGTON (AP) — An American contractor held hostage in Afghanistan for more than two years by the Taliban has been released, his family said Monday, as a Taliban drug lord jailed by the United States was also freed and returned to Kabul.Mark Frerichs, a Navy veteran who had spent more than a decade in Afghanistan as a civilian contractor, was abducted in January 2020 and was believed to have been since then by the Taliban-linked Haqqani network.Negotiations for his release had centered on a deal that would also involve the release of Bashir Noorzai, a notorious drug lord and member of the Taliban who told reporters in Kabul on Monday that he spent 17 years and six months in U.S. captivityThe Biden administration did not immediately confirm details of the prisoner swap, but a sister of Frerichs, who is from Lombard, Illinois, thanked U.S. government officials who helped secure her brother’s release.“I am so happy to hear that my brother is safe and on his way home to us. Our family has prayed for this each day of the more than 31 months he has been a hostage. We never gave up hope that he would survive and come home safely to us,” said a statement from the sister, Charlene Cakora.In Afghanistan, Noorzai told reporters at a press conference that he had been released from an unspecified U.S. prison and handed over earlier in the day to the Taliban in Kabul, in exchange for an American prisoner held in Afghanistan whom he did not identify.Other Taliban officials claimed Noorzai was held at the U.S. detention facility at Guantanamo Bay, but did not offer say anything to support that claim.The Taliban-appointed foreign minister, Amir Khan Muttaqi, also spoke at the press conference alongside Noorzai and welcomed the exchange, saying it marked the start of a “new era” in U.S.-Taliban relations.Frerichs, abducted on Jan. 31, 2020, was last seen in a video distributed earlier this year, pleading for his release so that he can be reunited with his family, according to a recording posted by The New Yorker magazine at the time.“This can be a new chapter between Afghanistan and the United States, this can open a new door for talks between both countries,” Muttaqi said at the Kabul presser.“This act shows us that all problems can be solved through talks and I thank both sides’ teams who worked so hard for this to happen,” Muttaqi added.Frerichs, of Lombard, Illinois, was believed to be held by the Taliban-affiliated Haqqani network, and U.S. officials across two presidential administrations had tried unsuccessfully to get him home. In the video, which marked the first time Frerichs was seen since his abduction, he says it was filmed last November.Videos of hostages are sometimes released to show proof that they are alive and to facilitate negotiations for a release, though it was not immediately clear if that was the case here. The New Yorker said it obtained the clip from an unidentified individual in Afghanistan.At the time, theFBIdeclined to comment on the video’s authenticity, but a sister of Frerichs, Charlene Cakora, issued a statement thanking the Taliban for releasing the video and describing it as “public confirmation of our family’s long-held belief that he is alive after more than two years in captivity.”Since their takeover of Afghanistan in August last year, the Taliban have demanded the United States release Noorzai in exchange for Frerichs amid expectations of such exchanges for U.S. citizens held in Afghanistan.However, there has been no public sign of Washington moving forward on any sort of prisoner trade or exchange.The Taliban also posted a brief video Monday on social media showing Noorzai’s arrival at the Kabul airport where he was welcomed by top Taliban officials, including Muttaqi.At the press conference, Noorzai expressed thankfulness at seeing his “mujahedeen brothers” — a reference to the Taliban — in Kabul.“I pray for more success of the Taliban,” he added. “I hope this exchange can lead to peace between Afghanistan and America, because an American was released and I am also free now.”___Faiez reported from Islamabad.", "summary": "American contractor Mark Frerichs, held hostage in Afghanistan by the Taliban for over two years, has been released. His release coincides with the freeing of Taliban drug lord Bashir Noorzai, who had been imprisoned by the U.S. for nearly 18 years. The Biden administration has not confirmed the details of the apparent prisoner swap.\n"}
